RT-Thread/rt-thread/bsp/apollo2/libraries/drivers/regs/am_reg_adc.h
// Select power mode to enter between active scans.
#define AM_REG_ADC_CFG_LPMODE_S                      3
#define AM_REG_ADC_CFG_LPMODE_M                      0x00000008
#define AM_REG_ADC_CFG_LPMODE(n)                     (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_ADC_CFG_LPMODE_MODE0                  0x00000000
#define AM_REG_ADC_CFG_LPMODE_MODE1                  0x00000008

// This bit enables Repeating Scan Mode.
#define AM_REG_ADC_CFG_RPTEN_S                       2
#define AM_REG_ADC_CFG_RPTEN_M                       0x00000004
#define AM_REG_ADC_CFG_RPTEN(n)                      (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_ADC_CFG_RPTEN_SINGLE_SCAN             0x00000000
#define AM_REG_ADC_CFG_RPTEN_REPEATING_SCAN          0x00000004

// This bit enables the ADC module. While the ADC is enabled, the ADCCFG and
// SLOT Configuration regsiter settings must remain stable and unchanged. All
// configuration register settings, slot configuration settings and window
// comparison settings should be written prior to setting the ADCEN bit to '1'.
#define AM_REG_ADC_CFG_ADCEN_S                       0
#define AM_REG_ADC_CFG_ADCEN_M                       0x00000001
#define AM_REG_ADC_CFG_ADCEN(n)                      (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_CFG_ADCEN_DIS                     0x00000000
#define AM_REG_ADC_CFG_ADCEN_EN                      0x00000001

//*****************************************************************************
//
// ADC_STAT - ADC Power Status
//
//*****************************************************************************
// Indicates the power-status of the ADC.
#define AM_REG_ADC_STAT_PWDSTAT_S                    0
#define AM_REG_ADC_STAT_PWDSTAT_M                    0x00000001
#define AM_REG_ADC_STAT_PWDSTAT(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_STAT_PWDSTAT_ON                   0x00000000
#define AM_REG_ADC_STAT_PWDSTAT_POWERED_DOWN         0x00000001

//*****************************************************************************
//
// ADC_SWT - Software trigger
//
//*****************************************************************************
// Writing 0x37 to this register generates a software trigger.
#define AM_REG_ADC_SWT_SWT_S                         0
#define AM_REG_ADC_SWT_SWT_M                         0x000000FF
#define AM_REG_ADC_SWT_SWT(n)                        (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_ADC_SWT_SWT_GEN_SW_TRIGGER            0x00000037

//*****************************************************************************
//
// ADC_SL0CFG - Slot 0 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL0CFG_ADSEL0_S                   24
#define AM_REG_ADC_SL0CFG_ADSEL0_M                   0x07000000
#define AM_REG_ADC_SL0CFG_ADSEL0(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_128_MSRMTS      0x07000000

// Set the Precision Mode For Slot.
#define AM_REG_ADC_SL0CFG_PRMODE0_S                  16
#define AM_REG_ADC_SL0CFG_PRMODE0_M                  0x00030000
#define AM_REG_ADC_SL0CFG_PRMODE0(n)                 (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_ADC_SL0CFG_PRMODE0_P14B               0x00000000
#define AM_REG_ADC_SL0CFG_PRMODE0_P12B               0x00010000
#define AM_REG_ADC_SL0CFG_PRMODE0_P10B               0x00020000
#define AM_REG_ADC_SL0CFG_PRMODE0_P8B                0x00030000

// Select one of the 14 channel inputs for this slot.
#define AM_REG_ADC_SL0CFG_CHSEL0_S                   8
#define AM_REG_ADC_SL0CFG_CHSEL0_M                   0x00000F00
#define AM_REG_ADC_SL0CFG_CHSEL0(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL0CFG_CHSEL0_SE0                 0x00000000
#define AM_REG_ADC_SL0CFG_CHSEL0_SE1                 0x00000100
#define AM_REG_ADC_SL0CFG_CHSEL0_SE2                 0x00000200
#define AM_REG_ADC_SL0CFG_CHSEL0_SE3                 0x00000300
#define AM_REG_ADC_SL0CFG_CHSEL0_SE4                 0x00000400
#define AM_REG_ADC_SL0CFG_CHSEL0_SE5                 0x00000500
#define AM_REG_ADC_SL0CFG_CHSEL0_SE6                 0x00000600
#define AM_REG_ADC_SL0CFG_CHSEL0_SE7                 0x00000700
#define AM_REG_ADC_SL0CFG_CHSEL0_SE8                 0x00000800
#define AM_REG_ADC_SL0CFG_CHSEL0_SE9                 0x00000900
#define AM_REG_ADC_SL0CFG_CHSEL0_DF0                 0x00000A00
#define AM_REG_ADC_SL0CFG_CHSEL0_DF1                 0x00000B00
#define AM_REG_ADC_SL0CFG_CHSEL0_TEMP                0x00000C00
#define AM_REG_ADC_SL0CFG_CHSEL0_BATT                0x00000D00
#define AM_REG_ADC_SL0CFG_CHSEL0_VSS                 0x00000E00

// This bit enables the window compare function for slot 0.
#define AM_REG_ADC_SL0CFG_WCEN0_S                    1
#define AM_REG_ADC_SL0CFG_WCEN0_M                    0x00000002
#define AM_REG_ADC_SL0CFG_WCEN0(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL0CFG_WCEN0_WCEN                 0x00000002

// This bit enables slot 0 for ADC conversions.
#define AM_REG_ADC_SL0CFG_SLEN0_S                    0
#define AM_REG_ADC_SL0CFG_SLEN0_M                    0x00000001
#define AM_REG_ADC_SL0CFG_SLEN0(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL0CFG_SLEN0_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL1CFG - Slot 1 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL1CFG_ADSEL1_S                   24
#define AM_REG_ADC_SL1CFG_ADSEL1_M                   0x07000000
#define AM_REG_ADC_SL1CFG_ADSEL1(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_128_MSRMTS      0x07000000

// Set the Precision Mode For Slot.
#define AM_REG_ADC_SL1CFG_PRMODE1_S                  16
#define AM_REG_ADC_SL1CFG_PRMODE1_M                  0x00030000
#define AM_REG_ADC_SL1CFG_PRMODE1(n)                 (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_ADC_SL1CFG_PRMODE1_P14B               0x00000000
#define AM_REG_ADC_SL1CFG_PRMODE1_P12B               0x00010000
#define AM_REG_ADC_SL1CFG_PRMODE1_P10B               0x00020000
#define AM_REG_ADC_SL1CFG_PRMODE1_P8B                0x00030000

// Select one of the 14 channel inputs for this slot.
#define AM_REG_ADC_SL1CFG_CHSEL1_S                   8
#define AM_REG_ADC_SL1CFG_CHSEL1_M                   0x00000F00
#define AM_REG_ADC_SL1CFG_CHSEL1(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL1CFG_CHSEL1_SE0                 0x00000000
#define AM_REG_ADC_SL1CFG_CHSEL1_SE1                 0x00000100
#define AM_REG_ADC_SL1CFG_CHSEL1_SE2                 0x00000200
#define AM_REG_ADC_SL1CFG_CHSEL1_SE3                 0x00000300
#define AM_REG_ADC_SL1CFG_CHSEL1_SE4                 0x00000400
#define AM_REG_ADC_SL1CFG_CHSEL1_SE5                 0x00000500
#define AM_REG_ADC_SL1CFG_CHSEL1_SE6                 0x00000600
#define AM_REG_ADC_SL1CFG_CHSEL1_SE7                 0x00000700
#define AM_REG_ADC_SL1CFG_CHSEL1_SE8                 0x00000800
#define AM_REG_ADC_SL1CFG_CHSEL1_SE9                 0x00000900
#define AM_REG_ADC_SL1CFG_CHSEL1_DF0                 0x00000A00
#define AM_REG_ADC_SL1CFG_CHSEL1_DF1                 0x00000B00
#define AM_REG_ADC_SL1CFG_CHSEL1_TEMP                0x00000C00
#define AM_REG_ADC_SL1CFG_CHSEL1_BATT                0x00000D00
#define AM_REG_ADC_SL1CFG_CHSEL1_VSS                 0x00000E00

// This bit enables the window compare function for slot 1.
#define AM_REG_ADC_SL1CFG_WCEN1_S                    1
#define AM_REG_ADC_SL1CFG_WCEN1_M                    0x00000002
#define AM_REG_ADC_SL1CFG_WCEN1(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL1CFG_WCEN1_WCEN                 0x00000002

// This bit enables slot 1 for ADC conversions.
#define AM_REG_ADC_SL1CFG_SLEN1_S                    0
#define AM_REG_ADC_SL1CFG_SLEN1_M                    0x00000001
#define AM_REG_ADC_SL1CFG_SLEN1(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL1CFG_SLEN1_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL2CFG - Slot 2 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL2CFG_ADSEL2_S                   24
#define AM_REG_ADC_SL2CFG_ADSEL2_M                   0x07000000
#define AM_REG_ADC_SL2CFG_ADSEL2(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_128_MSRMTS      0x07000000

// Set the Precision Mode For Slot.
#define AM_REG_ADC_SL2CFG_PRMODE2_S                  16
#define AM_REG_ADC_SL2CFG_PRMODE2_M                  0x00030000
#define AM_REG_ADC_SL2CFG_PRMODE2(n)                 (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_ADC_SL2CFG_PRMODE2_P14B               0x00000000
#define AM_REG_ADC_SL2CFG_PRMODE2_P12B               0x00010000
#define AM_REG_ADC_SL2CFG_PRMODE2_P10B               0x00020000
#define AM_REG_ADC_SL2CFG_PRMODE2_P8B                0x00030000

// Select one of the 14 channel inputs for this slot.
#define AM_REG_ADC_SL2CFG_CHSEL2_S                   8
#define AM_REG_ADC_SL2CFG_CHSEL2_M                   0x00000F00
#define AM_REG_ADC_SL2CFG_CHSEL2(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL2CFG_CHSEL2_SE0                 0x00000000
#define AM_REG_ADC_SL2CFG_CHSEL2_SE1                 0x00000100
#define AM_REG_ADC_SL2CFG_CHSEL2_SE2                 0x00000200
#define AM_REG_ADC_SL2CFG_CHSEL2_SE3                 0x00000300
#define AM_REG_ADC_SL2CFG_CHSEL2_SE4                 0x00000400
#define AM_REG_ADC_SL2CFG_CHSEL2_SE5                 0x00000500
#define AM_REG_ADC_SL2CFG_CHSEL2_SE6                 0x00000600
#define AM_REG_ADC_SL2CFG_CHSEL2_SE7                 0x00000700
#define AM_REG_ADC_SL2CFG_CHSEL2_SE8                 0x00000800
#define AM_REG_ADC_SL2CFG_CHSEL2_SE9                 0x00000900
#define AM_REG_ADC_SL2CFG_CHSEL2_DF0                 0x00000A00
#define AM_REG_ADC_SL2CFG_CHSEL2_DF1                 0x00000B00
#define AM_REG_ADC_SL2CFG_CHSEL2_TEMP                0x00000C00
#define AM_REG_ADC_SL2CFG_CHSEL2_BATT                0x00000D00
#define AM_REG_ADC_SL2CFG_CHSEL2_VSS                 0x00000E00

// This bit enables the window compare function for slot 2.
#define AM_REG_ADC_SL2CFG_WCEN2_S                    1
#define AM_REG_ADC_SL2CFG_WCEN2_M                    0x00000002
#define AM_REG_ADC_SL2CFG_WCEN2(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL2CFG_WCEN2_WCEN                 0x00000002

// This bit enables slot 2 for ADC conversions.
#define AM_REG_ADC_SL2CFG_SLEN2_S                    0
#define AM_REG_ADC_SL2CFG_SLEN2_M                    0x00000001
#define AM_REG_ADC_SL2CFG_SLEN2(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL2CFG_SLEN2_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL3CFG - Slot 3 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL3CFG_ADSEL3_S                   24
#define AM_REG_ADC_SL3CFG_ADSEL3_M                   0x07000000
#define AM_REG_ADC_SL3CFG_ADSEL3(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_128_MSRMTS      0x07000000

// Set the Precision Mode For Slot.
#define AM_REG_ADC_SL3CFG_PRMODE3_S                  16
#define AM_REG_ADC_SL3CFG_PRMODE3_M                  0x00030000
#define AM_REG_ADC_SL3CFG_PRMODE3(n)                 (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_ADC_SL3CFG_PRMODE3_P14B               0x00000000
#define AM_REG_ADC_SL3CFG_PRMODE3_P12B               0x00010000
#define AM_REG_ADC_SL3CFG_PRMODE3_P10B               0x00020000
#define AM_REG_ADC_SL3CFG_PRMODE3_P8B                0x00030000

// Select one of the 14 channel inputs for this slot.
#define AM_REG_ADC_SL3CFG_CHSEL3_S                   8
#define AM_REG_ADC_SL3CFG_CHSEL3_M                   0x00000F00
#define AM_REG_ADC_SL3CFG_CHSEL3(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL3CFG_CHSEL3_SE0                 0x00000000
#define AM_REG_ADC_SL3CFG_CHSEL3_SE1                 0x00000100
#define AM_REG_ADC_SL3CFG_CHSEL3_SE2                 0x00000200
#define AM_REG_ADC_SL3CFG_CHSEL3_SE3                 0x00000300
#define AM_REG_ADC_SL3CFG_CHSEL3_SE4                 0x00000400
#define AM_REG_ADC_SL3CFG_CHSEL3_SE5                 0x00000500
#define AM_REG_ADC_SL3CFG_CHSEL3_SE6                 0x00000600
#define AM_REG_ADC_SL3CFG_CHSEL3_SE7                 0x00000700
#define AM_REG_ADC_SL3CFG_CHSEL3_SE8                 0x00000800
#define AM_REG_ADC_SL3CFG_CHSEL3_SE9                 0x00000900
#define AM_REG_ADC_SL3CFG_CHSEL3_DF0                 0x00000A00
#define AM_REG_ADC_SL3CFG_CHSEL3_DF1                 0x00000B00
#define AM_REG_ADC_SL3CFG_CHSEL3_TEMP                0x00000C00
#define AM_REG_ADC_SL3CFG_CHSEL3_BATT                0x00000D00
#define AM_REG_ADC_SL3CFG_CHSEL3_VSS                 0x00000E00

