RT-Thread/rt-thread/bsp/apollo2/libraries/drivers/regs/am_reg_adc.h
// This bit enables the window compare function for slot 3.
#define AM_REG_ADC_SL3CFG_WCEN3_S                    1
#define AM_REG_ADC_SL3CFG_WCEN3_M                    0x00000002
#define AM_REG_ADC_SL3CFG_WCEN3(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL3CFG_WCEN3_WCEN                 0x00000002

// This bit enables slot 3 for ADC conversions.
#define AM_REG_ADC_SL3CFG_SLEN3_S                    0
#define AM_REG_ADC_SL3CFG_SLEN3_M                    0x00000001
#define AM_REG_ADC_SL3CFG_SLEN3(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL3CFG_SLEN3_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL4CFG - Slot 4 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL4CFG_ADSEL4_S                   24
#define AM_REG_ADC_SL4CFG_ADSEL4_M                   0x07000000
#define AM_REG_ADC_SL4CFG_ADSEL4(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_128_MSRMTS      0x07000000

// Set the Precision Mode For Slot.
#define AM_REG_ADC_SL4CFG_PRMODE4_S                  16
#define AM_REG_ADC_SL4CFG_PRMODE4_M                  0x00030000
#define AM_REG_ADC_SL4CFG_PRMODE4(n)                 (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_ADC_SL4CFG_PRMODE4_P14B               0x00000000
#define AM_REG_ADC_SL4CFG_PRMODE4_P12B               0x00010000
#define AM_REG_ADC_SL4CFG_PRMODE4_P10B               0x00020000
#define AM_REG_ADC_SL4CFG_PRMODE4_P8B                0x00030000

// Select one of the 14 channel inputs for this slot.
#define AM_REG_ADC_SL4CFG_CHSEL4_S                   8
#define AM_REG_ADC_SL4CFG_CHSEL4_M                   0x00000F00
#define AM_REG_ADC_SL4CFG_CHSEL4(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL4CFG_CHSEL4_SE0                 0x00000000
#define AM_REG_ADC_SL4CFG_CHSEL4_SE1                 0x00000100
#define AM_REG_ADC_SL4CFG_CHSEL4_SE2                 0x00000200
#define AM_REG_ADC_SL4CFG_CHSEL4_SE3                 0x00000300
#define AM_REG_ADC_SL4CFG_CHSEL4_SE4                 0x00000400
#define AM_REG_ADC_SL4CFG_CHSEL4_SE5                 0x00000500
#define AM_REG_ADC_SL4CFG_CHSEL4_SE6                 0x00000600
#define AM_REG_ADC_SL4CFG_CHSEL4_SE7                 0x00000700
#define AM_REG_ADC_SL4CFG_CHSEL4_SE8                 0x00000800
#define AM_REG_ADC_SL4CFG_CHSEL4_SE9                 0x00000900
#define AM_REG_ADC_SL4CFG_CHSEL4_DF0                 0x00000A00
#define AM_REG_ADC_SL4CFG_CHSEL4_DF1                 0x00000B00
#define AM_REG_ADC_SL4CFG_CHSEL4_TEMP                0x00000C00
#define AM_REG_ADC_SL4CFG_CHSEL4_BATT                0x00000D00
#define AM_REG_ADC_SL4CFG_CHSEL4_VSS                 0x00000E00

// This bit enables the window compare function for slot 4.
#define AM_REG_ADC_SL4CFG_WCEN4_S                    1
#define AM_REG_ADC_SL4CFG_WCEN4_M                    0x00000002
#define AM_REG_ADC_SL4CFG_WCEN4(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL4CFG_WCEN4_WCEN                 0x00000002

// This bit enables slot 4 for ADC conversions.
#define AM_REG_ADC_SL4CFG_SLEN4_S                    0
#define AM_REG_ADC_SL4CFG_SLEN4_M                    0x00000001
#define AM_REG_ADC_SL4CFG_SLEN4(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL4CFG_SLEN4_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL5CFG - Slot 5 Configuration Register
//
//*****************************************************************************
// Select number of measurements to average in the accumulate divide module for
// this slot.
#define AM_REG_ADC_SL5CFG_ADSEL5_S                   24
#define AM_REG_ADC_SL5CFG_ADSEL5_M                   0x07000000
#define AM_REG_ADC_SL5CFG_ADSEL5(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_128_MSRMTS      0x07000000

// Set the Precision Mode For Slot.
#define AM_REG_ADC_SL5CFG_PRMODE5_S                  16
#define AM_REG_ADC_SL5CFG_PRMODE5_M                  0x00030000
#define AM_REG_ADC_SL5CFG_PRMODE5(n)                 (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_ADC_SL5CFG_PRMODE5_P14B               0x00000000
#define AM_REG_ADC_SL5CFG_PRMODE5_P12B               0x00010000
#define AM_REG_ADC_SL5CFG_PRMODE5_P10B               0x00020000
#define AM_REG_ADC_SL5CFG_PRMODE5_P8B                0x00030000

// Select one of the 14 channel inputs for this slot.
#define AM_REG_ADC_SL5CFG_CHSEL5_S                   8
#define AM_REG_ADC_SL5CFG_CHSEL5_M                   0x00000F00
#define AM_REG_ADC_SL5CFG_CHSEL5(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL5CFG_CHSEL5_SE0                 0x00000000
#define AM_REG_ADC_SL5CFG_CHSEL5_SE1                 0x00000100
#define AM_REG_ADC_SL5CFG_CHSEL5_SE2                 0x00000200
#define AM_REG_ADC_SL5CFG_CHSEL5_SE3                 0x00000300
#define AM_REG_ADC_SL5CFG_CHSEL5_SE4                 0x00000400
#define AM_REG_ADC_SL5CFG_CHSEL5_SE5                 0x00000500
#define AM_REG_ADC_SL5CFG_CHSEL5_SE6                 0x00000600
#define AM_REG_ADC_SL5CFG_CHSEL5_SE7                 0x00000700
#define AM_REG_ADC_SL5CFG_CHSEL5_SE8                 0x00000800
#define AM_REG_ADC_SL5CFG_CHSEL5_SE9                 0x00000900
#define AM_REG_ADC_SL5CFG_CHSEL5_DF0                 0x00000A00
#define AM_REG_ADC_SL5CFG_CHSEL5_DF1                 0x00000B00
#define AM_REG_ADC_SL5CFG_CHSEL5_TEMP                0x00000C00
#define AM_REG_ADC_SL5CFG_CHSEL5_BATT                0x00000D00
#define AM_REG_ADC_SL5CFG_CHSEL5_VSS                 0x00000E00

// This bit enables the window compare function for slot 5.
#define AM_REG_ADC_SL5CFG_WCEN5_S                    1
#define AM_REG_ADC_SL5CFG_WCEN5_M                    0x00000002
#define AM_REG_ADC_SL5CFG_WCEN5(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL5CFG_WCEN5_WCEN                 0x00000002

// This bit enables slot 5 for ADC conversions.
#define AM_REG_ADC_SL5CFG_SLEN5_S                    0
#define AM_REG_ADC_SL5CFG_SLEN5_M                    0x00000001
#define AM_REG_ADC_SL5CFG_SLEN5(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL5CFG_SLEN5_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL6CFG - Slot 6 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL6CFG_ADSEL6_S                   24
#define AM_REG_ADC_SL6CFG_ADSEL6_M                   0x07000000
#define AM_REG_ADC_SL6CFG_ADSEL6(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_128_MSRMTS      0x07000000

// Set the Precision Mode For Slot.
#define AM_REG_ADC_SL6CFG_PRMODE6_S                  16
#define AM_REG_ADC_SL6CFG_PRMODE6_M                  0x00030000
#define AM_REG_ADC_SL6CFG_PRMODE6(n)                 (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_ADC_SL6CFG_PRMODE6_P14B               0x00000000
#define AM_REG_ADC_SL6CFG_PRMODE6_P12B               0x00010000
#define AM_REG_ADC_SL6CFG_PRMODE6_P10B               0x00020000
#define AM_REG_ADC_SL6CFG_PRMODE6_P8B                0x00030000

// Select one of the 14 channel inputs for this slot.
#define AM_REG_ADC_SL6CFG_CHSEL6_S                   8
#define AM_REG_ADC_SL6CFG_CHSEL6_M                   0x00000F00
#define AM_REG_ADC_SL6CFG_CHSEL6(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL6CFG_CHSEL6_SE0                 0x00000000
#define AM_REG_ADC_SL6CFG_CHSEL6_SE1                 0x00000100
#define AM_REG_ADC_SL6CFG_CHSEL6_SE2                 0x00000200
#define AM_REG_ADC_SL6CFG_CHSEL6_SE3                 0x00000300
#define AM_REG_ADC_SL6CFG_CHSEL6_SE4                 0x00000400
#define AM_REG_ADC_SL6CFG_CHSEL6_SE5                 0x00000500
#define AM_REG_ADC_SL6CFG_CHSEL6_SE6                 0x00000600
#define AM_REG_ADC_SL6CFG_CHSEL6_SE7                 0x00000700
#define AM_REG_ADC_SL6CFG_CHSEL6_SE8                 0x00000800
#define AM_REG_ADC_SL6CFG_CHSEL6_SE9                 0x00000900
#define AM_REG_ADC_SL6CFG_CHSEL6_DF0                 0x00000A00
#define AM_REG_ADC_SL6CFG_CHSEL6_DF1                 0x00000B00
#define AM_REG_ADC_SL6CFG_CHSEL6_TEMP                0x00000C00
#define AM_REG_ADC_SL6CFG_CHSEL6_BATT                0x00000D00
#define AM_REG_ADC_SL6CFG_CHSEL6_VSS                 0x00000E00

// This bit enables the window compare function for slot 6.
#define AM_REG_ADC_SL6CFG_WCEN6_S                    1
#define AM_REG_ADC_SL6CFG_WCEN6_M                    0x00000002
#define AM_REG_ADC_SL6CFG_WCEN6(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL6CFG_WCEN6_WCEN                 0x00000002

// This bit enables slot 6 for ADC conversions.
#define AM_REG_ADC_SL6CFG_SLEN6_S                    0
#define AM_REG_ADC_SL6CFG_SLEN6_M                    0x00000001
#define AM_REG_ADC_SL6CFG_SLEN6(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL6CFG_SLEN6_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL7CFG - Slot 7 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL7CFG_ADSEL7_S                   24
#define AM_REG_ADC_SL7CFG_ADSEL7_M                   0x07000000
#define AM_REG_ADC_SL7CFG_ADSEL7(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_128_MSRMTS      0x07000000

// Set the Precision Mode For Slot.
#define AM_REG_ADC_SL7CFG_PRMODE7_S                  16
#define AM_REG_ADC_SL7CFG_PRMODE7_M                  0x00030000
#define AM_REG_ADC_SL7CFG_PRMODE7(n)                 (((uint32_t)(n) << 16) & 0x00030000)
#define AM_REG_ADC_SL7CFG_PRMODE7_P14B               0x00000000
#define AM_REG_ADC_SL7CFG_PRMODE7_P12B               0x00010000
#define AM_REG_ADC_SL7CFG_PRMODE7_P10B               0x00020000
#define AM_REG_ADC_SL7CFG_PRMODE7_P8B                0x00030000

// Select one of the 14 channel inputs for this slot.
#define AM_REG_ADC_SL7CFG_CHSEL7_S                   8
#define AM_REG_ADC_SL7CFG_CHSEL7_M                   0x00000F00
#define AM_REG_ADC_SL7CFG_CHSEL7(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL7CFG_CHSEL7_SE0                 0x00000000
#define AM_REG_ADC_SL7CFG_CHSEL7_SE1                 0x00000100
#define AM_REG_ADC_SL7CFG_CHSEL7_SE2                 0x00000200
#define AM_REG_ADC_SL7CFG_CHSEL7_SE3                 0x00000300
#define AM_REG_ADC_SL7CFG_CHSEL7_SE4                 0x00000400
#define AM_REG_ADC_SL7CFG_CHSEL7_SE5                 0x00000500
#define AM_REG_ADC_SL7CFG_CHSEL7_SE6                 0x00000600
#define AM_REG_ADC_SL7CFG_CHSEL7_SE7                 0x00000700
#define AM_REG_ADC_SL7CFG_CHSEL7_SE8                 0x00000800
#define AM_REG_ADC_SL7CFG_CHSEL7_SE9                 0x00000900
#define AM_REG_ADC_SL7CFG_CHSEL7_DF0                 0x00000A00
#define AM_REG_ADC_SL7CFG_CHSEL7_DF1                 0x00000B00
#define AM_REG_ADC_SL7CFG_CHSEL7_TEMP                0x00000C00
#define AM_REG_ADC_SL7CFG_CHSEL7_BATT                0x00000D00
#define AM_REG_ADC_SL7CFG_CHSEL7_VSS                 0x00000E00

